app/controllers/posts_controller.rb

INSERT INTO "posts" ("position", "created_at", "title", "updated_at") VALUES(NULL, '2010-06-22 21:51:30', 'This is a post', '2010-06-22 21:51:30')
---
  def create
    @post = Post.new(params[:post])
    respond_to do |format|
      if @post.save

SELECT * FROM "posts" ORDER BY position LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "posts"
---
  def index
    @posts = Post.paginate(:page => params[:page], :order => "position", :per_page => POSTS_PER_PAGE)

UPDATE "posts" SET position=1 WHERE (id='2')
---
  def sort
    params[:posts].each_with_index do |id, index|
      Post.update_all(['position=?', index+1], ['id=?', id])

SELECT * FROM "posts" WHERE (1 = 1) ORDER BY position DESC LIMIT 1
---
  def find_post
    @post = Post.find(params[:id]) if params[:id]